In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])

In [4]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [5]:
dates = pd.date_range('20130101', periods=6)

In [6]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [7]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=['A', 'B', 'C', 'D'])

In [8]:
df

                   A         B         C         D
2013-01-01 -0.304844 -0.569937 -1.020836  0.474646
2013-01-02 -0.736465  0.239295  0.322015 -0.327329
2013-01-03  0.124146 -0.833812  1.325123  0.021536
2013-01-04 -0.368430 -0.054899  0.781321 -0.724804
2013-01-05 -0.062442 -0.053818 -1.292825 -0.127983
2013-01-06 -0.283448  0.017300  0.558319  1.081896

In [9]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [10]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [11]:
df.values

array([[-0.30484374, -0.56993675, -1.02083618,  0.47464585],
       [-0.73646482,  0.23929453,  0.3220146 , -0.32732919],
       [ 0.12414619, -0.83381212,  1.32512282,  0.0215363 ],
       [-0.36842955, -0.0548991 ,  0.78132071, -0.72480398],
       [-0.06244151, -0.05381767, -1.2928255 , -0.12798297],
       [-0.2834476 ,  0.01729952,  0.55831877,  1.08189589]])

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2013-01-01 to 2013-01-06
Freq: D
Data columns (total 4 columns):
A    6 non-null float64
B    6 non-null float64
C    6 non-null float64
D    6 non-null float64
dtypes: float64(4)
memory usage: 368.0 bytes

In [13]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.271914 -0.209312  0.112186  0.066327
std    0.292261  0.405135  1.041136  0.635409
min   -0.736465 -0.833812 -1.292825 -0.724804
25%   -0.352533 -0.441177 -0.685123 -0.277493
50%   -0.294146 -0.054358  0.440167 -0.053223
75%   -0.117693 -0.000480  0.725570  0.361368
max    0.124146  0.239295  1.325123  1.081896

In [14]:
df.sort_values(by='B', ascending=False)

                   A         B         C         D
2013-01-02 -0.736465  0.239295  0.322015 -0.327329
2013-01-06 -0.283448  0.017300  0.558319  1.081896
2013-01-05 -0.062442 -0.053818 -1.292825 -0.127983
2013-01-04 -0.368430 -0.054899  0.781321 -0.724804
2013-01-01 -0.304844 -0.569937 -1.020836  0.474646
2013-01-03  0.124146 -0.833812  1.325123  0.021536

In [15]:
df['A']

2013-01-01   -0.304844
2013-01-02   -0.736465
2013-01-03    0.124146
2013-01-04   -0.368430
2013-01-05   -0.062442
2013-01-06   -0.283448
Freq: D, Name: A, dtype: float64

In [16]:
df[0:2]

                   A         B         C         D
2013-01-01 -0.304844 -0.569937 -1.020836  0.474646
2013-01-02 -0.736465  0.239295  0.322015 -0.327329

In [17]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02 -0.736465  0.239295  0.322015 -0.327329
2013-01-03  0.124146 -0.833812  1.325123  0.021536
2013-01-04 -0.368430 -0.054899  0.781321 -0.724804

In [18]:
df.loc[dates[0]]

A   -0.304844
B   -0.569937
C   -1.020836
D    0.474646
Name: 2013-01-01 00:00:00, dtype: float64

In [19]:
df.loc[:, ['A', 'B']]

                   A         B
2013-01-01 -0.304844 -0.569937
2013-01-02 -0.736465  0.239295
2013-01-03  0.124146 -0.833812
2013-01-04 -0.368430 -0.054899
2013-01-05 -0.062442 -0.053818
2013-01-06 -0.283448  0.017300

In [20]:
df.loc['20130102':'20130104', ['A','B']]

                   A         B
2013-01-02 -0.736465  0.239295
2013-01-03  0.124146 -0.833812
2013-01-04 -0.368430 -0.054899

In [21]:
df.iloc[3]

A   -0.368430
B   -0.054899
C    0.781321
D   -0.724804
Name: 2013-01-04 00:00:00, dtype: float64

In [22]:
df.iloc[0:4]

                   A         B         C         D
2013-01-01 -0.304844 -0.569937 -1.020836  0.474646
2013-01-02 -0.736465  0.239295  0.322015 -0.327329
2013-01-03  0.124146 -0.833812  1.325123  0.021536
2013-01-04 -0.368430 -0.054899  0.781321 -0.724804

In [23]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02 -0.736465  0.322015
2013-01-03  0.124146  1.325123
2013-01-05 -0.062442 -1.292825

In [24]:
df

                   A         B         C         D
2013-01-01 -0.304844 -0.569937 -1.020836  0.474646
2013-01-02 -0.736465  0.239295  0.322015 -0.327329
2013-01-03  0.124146 -0.833812  1.325123  0.021536
2013-01-04 -0.368430 -0.054899  0.781321 -0.724804
2013-01-05 -0.062442 -0.053818 -1.292825 -0.127983
2013-01-06 -0.283448  0.017300  0.558319  1.081896

In [25]:
df[df.A > 0]

                   A         B         C         D
2013-01-03  0.124146 -0.833812  1.325123  0.021536

In [26]:
df[df > 0]

                   A         B         C         D
2013-01-01       NaN       NaN       NaN  0.474646
2013-01-02       NaN  0.239295  0.322015       NaN
2013-01-03  0.124146       NaN  1.325123  0.021536
2013-01-04       NaN       NaN  0.781321       NaN
2013-01-05       NaN       NaN       NaN       NaN
2013-01-06       NaN  0.017300  0.558319  1.081896

In [27]:
df2 = df.copy()

In [28]:
df2

                   A         B         C         D
2013-01-01 -0.304844 -0.569937 -1.020836  0.474646
2013-01-02 -0.736465  0.239295  0.322015 -0.327329
2013-01-03  0.124146 -0.833812  1.325123  0.021536
2013-01-04 -0.368430 -0.054899  0.781321 -0.724804
2013-01-05 -0.062442 -0.053818 -1.292825 -0.127983
2013-01-06 -0.283448  0.017300  0.558319  1.081896

In [29]:
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']

In [30]:
df2

                   A         B         C         D      E
2013-01-01 -0.304844 -0.569937 -1.020836  0.474646    one
2013-01-02 -0.736465  0.239295  0.322015 -0.327329    one
2013-01-03  0.124146 -0.833812  1.325123  0.021536    two
2013-01-04 -0.368430 -0.054899  0.781321 -0.724804  three
2013-01-05 -0.062442 -0.053818 -1.292825 -0.127983   four
2013-01-06 -0.283448  0.017300  0.558319  1.081896  three

In [33]:
df2['E'].isin(['two', 'four'])

2013-01-01    False
2013-01-02    False
2013-01-03     True
2013-01-04    False
2013-01-05     True
2013-01-06    False
Freq: D, Name: E, dtype: bool

In [34]:
df2[df2['E'].isin(['two', 'four'])]

                   A         B         C         D     E
2013-01-03  0.124146 -0.833812  1.325123  0.021536   two
2013-01-05 -0.062442 -0.053818 -1.292825 -0.127983  four

In [35]:
df

                   A         B         C         D
2013-01-01 -0.304844 -0.569937 -1.020836  0.474646
2013-01-02 -0.736465  0.239295  0.322015 -0.327329
2013-01-03  0.124146 -0.833812  1.325123  0.021536
2013-01-04 -0.368430 -0.054899  0.781321 -0.724804
2013-01-05 -0.062442 -0.053818 -1.292825 -0.127983
2013-01-06 -0.283448  0.017300  0.558319  1.081896

In [36]:
df.apply(np.cumsum)

                   A         B         C         D
2013-01-01 -0.304844 -0.569937 -1.020836  0.474646
2013-01-02 -1.041309 -0.330642 -0.698822  0.147317
2013-01-03 -0.917162 -1.164454  0.626301  0.168853
2013-01-04 -1.285592 -1.219353  1.407622 -0.555951
2013-01-05 -1.348033 -1.273171  0.114796 -0.683934
2013-01-06 -1.631481 -1.255872  0.673115  0.397962

In [37]:
df.apply(lambda x: x.max() - x.min())

A    0.860611
B    1.073107
C    2.617948
D    1.806700
dtype: float64